app/Http/Controllers/Admin/ManagerController.php

    public function index(){
    	$data=Manager::get();
---
select * from `manager`