app/Http/Controllers/Admin/MemberController.php

    public function index(){
    	$data=Member::get();
---
select * from `member`

    public function add(){
    	 if(Input::method() == 'POST'){
            // dd('nihao');
            // 'avatar'       =>'/statics/avatar.jpg',
    	 	$result=Member::insert([
                'username'     =>Input::get('username'),
                'password'     =>bcrypt('password'),
                'gender'       =>Input::get('gender'),
                'mobile'       =>Input::get('mobile'),
                'email'        =>Input::get('email'),
                'avatar'       =>Input::get('avatar'),
                'province_id'  =>Input::get('province_id'),
                'city_id'      =>Input::get('city_id'),
                'county_id'    =>Input::get('county_id'),
                'zhen_id'      =>Input::get('zhen_id'),
                'type'         =>Input::get('type'),
                'status'       =>Input::get('status'),
                'created_at'   =>date('Y-m-d H:i:s'),
                'updated_at'   =>date('Y-m-d H:i:s')
            ]);
            return $result ? 1 : 0;
    	 }else{
            $provinces=DB::table('area')->where('pid','0')->get();
---
select * from `area` where `pid` = '0'