app/Http/Controllers/Admin/ProfessionController.php

select * from `profession`
---
    public function index(){
    	//获取数据
    	$data=Profession::get();