app/Http/Controllers/Admin/ProtypeController.php

    public function index(){
    	//获取数据
    	$data=Protype::get();
---
select * from `protype`