app/Http/Controllers/Admin/RoleController.php

    public function index(){
    	//列表数据
    	$data = Role::get();
---
select * from `role`